<?PHP
//标题
$_['heading_step_1'] ='许可协议';
$_['heading_step_1_small'] ='请阅读OpenCart许可协议';
$_['heading_step_2'] ='预安装';
$_['heading_step_2_small'] ='请检查你的服务器是建立正确的';
$_['heading_step_3'] ='配置';
$_['heading_step_3_small'] ='请输入您的数据库和管理信息';
$_['heading_step_4'] ='安装完成';
$_['heading_step_4_small'] ='准备开始销售！';
$_['heading_maxmind'] ='的MaxMind';
$_['heading_maxmind_small'] ='欺诈检测服务。';
$_['heading_openbay'] ='OpenBay Pro的';
$_['heading_openbay_small'] ='多市场一体化';

//文本
$_['text_license'] ='许可';
$_['text_installation'] ='预安装';
$_['text_configuration'] ='配置';
$_['text_finished'] ='完成安装';
$_['text_install_php'] ='1、请配置PHP设置，以符合下列要求';
$_['text_install_extension'] ='2、请确保安装下面列出的PHP扩展';
$_['text_install_db'] ='3/请确保你至少有一个可用的数据库驱动程序';
$_['text_install_file'] ='4、请确保您已设置的文件列表上的正确的权限下面';
$_['text_install_directory'] ='5、请确保你已经设置的目录清单上正确的权限之下';
$_['text_db_connection'] ='1、请输入您的数据库连接的详细信息';
$_['text_db_administration'] ='2、请输入用户名和密码的管理';
$_['text_congratulation'] ='恭喜！您已成功安装OpenCart';
$_['text_setting'] ='PHP设置';
$_['text_current'] ='当前设置';
$_['text_required'] ='系统要求';
$_['text_extension'] ='PHP扩展';
$_['text_database'] ='数据库驱动程序';
$_['text_file'] ='文件';
$_['text_directory'] ='目录';
$_['text_status'] ='状态';
$_['text_version'] ='PHP版本';
$_['text_global'] ='注册全局';
$_['text_magic'] ='魔术引号GPC';
$_['text_file_upload'] ='文件上传';
$_['text_session'] ='会话自动启动';
$_['text_db'] ='数据库';
$_['text_mysqli'] ='MySQLi扩展';
$_['text_mysql'] ='MySQL扩展';
$_['text_mpdo'] ='MPDO扩展';
$_['text_gd'] ='GD库';
$_['text_curl'] ='CURL库';
$_['text_mcrypt'] ='mcrypt扩展';
$_['text_zlib'] ='ZLIB扩展';
$_['text_zip'] ='邮政编码';
$_['text_mbstring'] ='mbstring支持';
$_['text_on'] ='开';
$_['text_off'] ='关';
$_['text_writable'] ='可写';
$_['text_unwritable'] ='不可写';
$_['text_missing'] ='失踪';
$_['text_forget'] ='请不要忘记删除你的安装目录！';
$_['text_shop'] ='到前台查看';
$_['text_login'] ='登陆到后台';
$_['text_project'] ='项目主页';
$_['text_documentation'] ='文件';
$_['text_support'] ='支持论坛';
$_['text_footer'] ='版权所有©2014年OpenCart  - 保留所有权利';
$_['text_view'] ='查看详情';
$_['text_download'] ='下载';
$_['text_downloads'] ='下载';
$_['text_price'] ='价格';
$_['text_view'] ='查看详情';
$_['text_maxmind_success'] ='的MaxMind欺诈服务已安装';
$_['text_maxmind_top'] ='如果你不\'吨有一个许可证密钥，你可以';
$_['text_maxmind_link'] ='在此注册';
$_['text_ebay_about'] ='易趣是一个数十亿美元的市场，让商务或私人卖家拍卖和零售商品在线。提供给世界各地的卖家。';
$_['text_amazon_about'] ='亚马逊商城固定价格的在线市场，允许卖家提供新的和用过的物品旁边亚马逊\的常规零售服务';

//进入
$_['entry_db_driver'] ='DB驱动程序';
$_['entry_db_hostname'] ='主机名';
$_['entry_db_username'] ='用户名';
$_['entry_db_password'] ='密码';
$_['entry_db_database'] ='数据库';
$_['entry_db_prefix'] ='字头';
$_['entry_username'] ='用户名';
$_['entry_password'] ='密码';
$_['entry_email'] ='电子邮件';
$_['entry_licence_key'] ='许可证';
$_['entry_risk'] ='风险评分';
$_['entry_fraud_status'] ='欺诈订单状态';

//救命
$_['help_maxmind_risk'] ='的更可能的顺序是欺诈得分越高。设置为0的比分 -  100。';
$_['help_maxmind_fraud'] ='在您所设定的分数订单将被分配了此订单状态，并不会被允许自动达到​​完整的状态。';

//错误
$_['error_key'] ='的MaxMind的许可证密钥要求';
$_['error_score'] ='0和100之间的分数被接受';
$_['error_db_hostname'] ='需要主机名！';
$_['error_db_username'] ='所需的用户名！';
$_['error_db_database']='所需的数据库名称!';
$_['error_db_prefix'] ='DB前缀只能包含小写字符的AZ范围内，0-9和下划线';
$_['error_db_connect'] ='错误：无法连接到数据库，请确保数据库服务器，用户名和密码是正确的！';
$_['error_username'] ='所需的用户名！';
$_['error_password'] ='需要密码！';
$_['error_email'] ='无效的电子邮件！';
$_['error_config'] ='错误：无法写入config.php文件，请检查是否设置了正确的权限：';

//按钮
$_['button_continue'] ='下一步';
$_['button_back'] ='返回';
$_['button_register'] ='注册';
$_['button_register_eu'] ='注册欧洲';
$_['button_register_us'] ='注册USA';

$_['text_terms'] ='<H3> GNU通用公共许可证</ H3>
        <P>第3版，2007年6月29日</ P>
        <P>版权及复印件; 2007年自由软件基金会，公司和LT; HTTP：//fsf.org/&gt; </ P>
        <P>允许每个人复制和分发逐字复制
          本授权文件的，但改变它是不允许的。</ P>
        <H3> <a name="preamble"> </a>序言</ H3>
        <P> GNU通用公共许可证是免费的，非盈利版权许可
          软件等各类作品。</ P>
        <P>该许可证的大多数软件和其他实用的工程设计
          带走你的自由共享和修改的作品。与此相反，
          GNU通用公共许可证力图保证你的自由
          分享和更改所有版本的程序 - 以确保它仍然是免费的
          软件对所有用户。我们，自由软件基金会，使用
          GNU通用公共许可证的大多数我们的软件;它也适用于
          任何其他工作由其作者以这种方式发布。你可以把它应用到
          你的程序中。</ P>
        <p>当我们在谈论自由软件时，我们指的是自由，而不是
          价格。我们的通用公共许可证旨在确保您
          有自由发布自由软件副本（以及充电
          他们，如果你愿意的话），您会收到源代码或者，如果你得到它
          想要的话，你可以修改软件或将它的一部分用于新的
          免费节目，那你知道你能做这些事情。</ P>
        <p>要保护你的权利，我们需要禁止任何人否认您
          这些权利或者要求你放弃这些权利。因此，你有
          某些责任如果您发布软件的副本，或者
          你修改它：责任，尊重他人的自由</ P>
        <p>例如，如果你发布这样一个程序的副本是否
          免费还是收费，你必须传递给收件人相同
          您收到的自由。你必须确保他们也能收到
          或者可以得到源代码。你必须向他们展示这些条款，以使其
          知道自己的权利。</ P>
        <p>开发使用GNU GPL采取两项措施来保护您的权利：
          （1）声明软件的版权;（2）给你提供许可证
          让您的法律许可，复制，分发和/或修改。</ P>
        <P>对于开发商\'和作者\'保护，GPL清楚地解释
          没有担保责任的自由软件。对于用户\'和
          作者\'的缘故，GPL要求修改版本被标记为
          改变，使他们的问题不会被错误地归因
          以前版本的作者。</ P>
        <P>某些设备被设计成拒绝用户安装或运行
          它们内部的软件的修改版本，虽然制造商
          可以这样做。这与目标根本不相容
          保护用户\'自由改变软件。系统
          这种滥用的模式出现在产品为个人区域
          使用，这恰恰是最让人无法接受。因此，我们
          设计了这个版本的GPL，禁止这些做法
          产品。如果此类问题在其他领域大量出现，我们
          愿这一规定延伸到未来版本的域
          GPL的，因为需要保护用户的自由。</ P>
        <P>最后，每个程序都不断受到软件专利的威胁。
          美国不应该允许专利权限制开发和利用
          软件在通用计算机，但在那些做的，我们希望
          避免特殊危险的专利应用到一个免费程序能
          使它更有效专利。为了防止这种情况，GPL保证了
          专利不能用于呈现节目非自由</ P>
        <P>明确条款和条件复制，分发和
          后续的修改</ P>
        <H3> <a name="terms"> </a>条款和条件</ H3>
        <H4> <a id="section0"> </a> 0。定义。</ H4>
        <P>＆ldquo;本许可＆rdquo;的指GNU通用公共授权版本。</ P>
        <P>＆ldquo;版权＆rdquo;的同样指适用于其他类型的保护版权的法律
          作品，如半导体口罩。</ P>
        <P>＆ldquo;程序＆rdquo;的是指根据本许可的任何受版权保护的作品
          许可证。被授权人的＆ldquo;你＆rdquo ;. ＆ldquo;被授权人＆rdquo;的和
          ＆ldquo;收件人＆rdquo;的可以是个人或组织。</ P>
        <p>要＆ldquo;修改＆rdquo;的一个工作装置，从要复制或适应所有的工作的全部或部分
          在需要版权许可的，比的制作等
          完全相同的副本。该成果被称为＆ldquo;修改后的版本＆rdquo;的的
          早期的工作或工作＆ldquo;根据＆rdquo;的先前的工作。</ P>
        <P> A＆ldquo;保工作＆rdquo;的指未被修改程序或基于工作
          上的程序。</ P>
        <p>要＆ldquo;＆传播rdquo;的一个工作手段，它是做什么，不
          权限，将让你直接或其次承担责任
          根据适用著作权法侵权，但在执行它
          计算机或修改私有副本。传播包括复制，
          分布（有或没有修饰），使得提供给
          公开的，以及在一些国家的其他活动，以及</ P>
        <p>要＆ldquo;＆转达rdquo;的工作是指任何类型的传播，使其他
          当事人制作或者接受副本。与通过用户仅仅交互
          计算机网络，没有转移的副本，不输送。</ P>
        <P>交互式用户界面显示和ldquo;适当的法律通告＆rdquo;的
          的范围内，它包括一个方便而显着可见
          功能（1）显示适当的版权声明，以及（2）
          告诉用户是没有保修的工作（除到
          某种程度上，保证提供），被许可人可以传达
          根据本许可工作，以及如何查看本许可证的副本。如果
          界面呈现用户命令或选择，如一个列表
          菜单，列表中的一个突出的项满足这一标准。</ P>
        <H4> <a id="section1"> </a> 1。源代码。</ H4>
        <P>＆将ldquo;源代码＆rdquo;的用于作业装置的工作的优选形式
          为进行修改时。 ＆ldquo;目标代码＆rdquo;的指任何非源
          形式的工作。</ P>
        <P> A＆ldquo;标准接口和rdquo;的是指一个接口，要么是官方
          由一个公认的标准体标准定义的，或者，在的情况下
          对于一个特定的编程语言，之一所指定的接口那
          被广泛用于在开发人员使用该语言的工作。</ P>
        <P>＆将ldquo;系统库＆rdquo;的一个可执行的工作包括什么，其他
          比工作作为一个整体，是：（a）包括在正常形式
          包装的主要组成部分，但不是主要的组成部分
          成分，以及（b）用于只使用与该工作的
          主要部件，或者实现一个标准接口为其中
          实现向公众提供源代码的形式。一
          ＆ldquo;主要部件＆rdquo ;,在这种情况下，是指主要的关键部件
          （内核，窗口系统等）的特定操作系统的
          （如果有的话），在其上可执行程序时，或编译器来使用
          生产的工作，或者用来运行它的目标代码解释。</ P>
        <P>＆将ldquo;对应的源代码＆rdquo;的在目标工作代码形式是指所有
          所需的源代码，以产生，安装和（为一个可执行
          工作）运行目标代码和修改的工作，包括脚​​本
          控制这些活动。然而，它不包括工作\的
          系统库，或通用工具或一般可用免费
          这是在执行这些活动中使用未经修改的方案，但
          这是不工作的一部分。例如，对应的源代码
          包括与源文件相关的接口定义文件
          的工作，和对共享库和动态的源代码
          联子程序，该工作是专门设计要求，
          如由那些之间的紧密的数据通信或控制流
          子程序和工作的其他部分。</ P>
        <P>相应的源不需要包含任何用户
          可以从相应的其他部分自动再生
          源。</ P>
        <P>在源代码形式的相应的源是
          同样的工作。</ P>
        <H4> <a id="section2"> </a> 2。基本权限。</ H4>
        <P>本授权下授予的一切权利授予的期限
          版权的计划，并不可撤销的前提规定的
          条件得到满足。本授权明确的确认您无限
          允许运行未经修改的程序。从运行的输出
          覆盖工作许可证条款只有当输出，赋予其
          内容，构成了覆盖工作。本授权承认您
          合理使用或其他等效，受版权法规定的权利。</ P>
        <p>您可以制作，运行和传播覆盖工作，你不
          传达，没有条件，只要您的许可证，否则遗体
          现行。您可以传送覆盖工程，以他人为唯一目的
          具有它们进行修改专门为您或您提供
          与运行这些工程设施，只要您遵守
          本许可证的传达，而您做的所有材料的条款
          无法控制的版权。因此，那些制作或运行覆盖工程
          你必须这样做完全代表你，在你的方向
          和控制，禁止他们作出的任何副本
          以外的与你的关系您的版权材料。</ P>
        <P>在任何其他情况下输送被允许只在
          下面所列的条件。再许可是不允许的;第10条
          使得没有必要</ P>
        <H4> <a id="section3"> </a> 3。保护用户\'合法权利不受反规避法。</ H4>
        有效的技术<p>没有覆盖的工​​作将被视为一部分
          在履行第义务的适用法律措施
          1996年12月WIPO版权条约11通过了关于20，或
          类似的法律禁止或限制的规避等
          措施。</ P>
        <p>当你传达一个覆盖工作，你放弃任何合法的权力来禁止
          技术措施的范围内规避这种规避
          通过对于本授权下行使权利的实现
          覆盖的工作，您放弃任何限制操作或
          修改的工作作为强制执行的手段，对工作\的
          用户，您或第三方\的合法权益，禁止规避
          技术措施。</ P>
        <H4> <a id="section4"> </a> 4。输送完整副本。</ H4>
        <p>您可以传送的程序\的源代码完整副本，你
          接受它，任何媒体，只要你和显着
          每个复制适当的版权声明适当公布;
          完整保留所有通知，声明本授权以及任何
          添加符合第7个非许可条款适用于代码;
          完整保留了无担保的所有通知;并给所有
          随着计划受助人本许可证的副本。</ P>
        <p>您可以收取任何价格或没有价格为每复制您传达，
          你也可以提供支持或担保保护费。</ P>
        <H4> <a id="section5"> </a> 5。输送修改后的源版本。</ H4>
        <p>您可以传送基于程序的作品，或修改
          从计划生产它，在源代码下的形式
          条款第4条，前提是您必须符合以下条件：</ P>
        <ul>
          <LI>一）工作，必须明确的通告说明你修改
            它，并给出相应的日期。</ li>
          <LI> b）该作品必须附有明确的说明，这是
            本许可证发布，并根据第附加任何条件
            7.本要求修改了第4节的要求
            ＆ldquo;维持所有通知和rdquo;的。</ li>
          <LI> c）你必须许可的全部工作，作为一个整体，根据本
            授权给任何人谁进入藏的副本。此
            因此，许可证将适用，以及任何适用的第7
            附加条款，对整个工作，它的所有部件，
            不管它们是如何包装。本许可没有给出
            权限许可以任何其他方式的工作，但它不会
            这种无效的权限，如果你已经分别收到了。</ li>
          <LI> d）如果工作具有交互式用户界面，每个人都必须展示
            适当的法律通告;但是，如果该方案具有互动
            接口不显示适当的法律通告，你
            工作不必让他们这样做。</ li>
        </ ul>
        <P>有盖的工作与其他个别及独立汇编
          作品，这是不被覆盖的各自的工作性质的扩展，
          并且与它不结合，如以形成一个更大的程序，
          或存储或发布媒体的同一卷上，被称为
          ＆ldquo;聚集体rdquo;的如果程序和相应产生的版权没有
          用来限制编译\的用户的访问或合法权益
          超出原来的独立工程许可证。一个覆盖工作纳入
          在聚合不会导致本许可证应用到其他
          份的聚合的</ P>
        <H4> <a id="section6"> </a> 6。输送无源代码格式。</ H4>
        <p>您可以根据传达的条款以目标代码形式的工作覆盖
          第4和第5的，只要你还传达了
          根据本许可的条款机器可读的对应的源代码，
          以下列方式之一：</ P>
        <ul>
          <LI>一）传达的目标代码，或体现在，实体产品
            （包括一个物理的发布媒介）的陪同下，
            相应的源固定持久的物理介质上
            通常用于软件交换。</ li>
          <LI> B）传达的目标代码，或体现在，实体产品
            （包括一个物理的发布媒介），伴随着
            书面报价，有效期至少为三年，有效期为
            只要您提供备件或客户支持该产品
            模式，给任何人谁拥有该目标代码的（1）
            在对应的源代码在所有的软件副本
            这是本许可证条款，在持久实体产品
            媒体通常用于软件交换，以优惠的价格没有
            超过您合理的实际执行这个成本
            输送源，或（2）获得的复制
            相应的从网络服务器源不收取任何费用。</ li>
          <LI> C）传达目标代码的个人用副本的副本
            书面报价，以提供对应源。此
            另一种方法是只允许偶尔和盈利，且
            仅当您收到的目标代码这样的提议，在雅阁
            与第6B。</ li>
          <LI> D）通过从指定的提供接入传达的目标代码
            地点（免费或收费），并提供等效访问
            通过在同一地点对应源中相同的方式没有
            再进行充电。您不需要要求接收者复制
            对应的源代码以及目标代码。如果地方
            复制的对象代码是一个网络服务器，对应的源代码
            可能是一个不同的服务器上（由您或第三方运作）上
            支持相同复制功能，只要你保持
            明确的方向靠近目标代码说在哪里可以找到
            相应的源代码。无论什么样的服务器托管
            相应的源代码，您都有义务保证它
            可供只要需要满足这些要求。</ LI>
          <LI> E）传达使用对等传输的目标代码，提供
            你通知其他同行那里的目标代码和相应的
            工作的源被提供给公众，不
            收款6D。</ li>
        </ ul>
        <P>目标代码，其源代码的可分离部分除外
          从对应的源代码作为系统库，不必
          包含在发布目标代码的工作。</ P>
        <P> A＆ldquo;用户产品＆rdquo;的或者是（1）＆ldquo;消费品＆rdquo，这意味着任何
          有形动产它通常用于个人，家庭，
          或家庭目的，或（2）任何设计或制造用于出售掺入
          进入住宅。在判断一个产品是否是消费品，
          疑点的案例将以有利于覆盖面来解决。对于一特定
          由一个特定的用户接收到的产品，＆ldquo;通常使用＆rdquo;的是指一种
          典型或共同使用该类产品，无论地位
          特定用户的方式或在该特定用户
          实际使用，或者期望或预期使用，该产品。一个产品
          是一种消费产品不论该产品是否具有实质
          商业，工业和非消费用途，除非该用处是此类
          使用该产品的唯一显著模式</ P>
        <P>＆ldquo;安装信息＆rdquo;的对于一个用户产品是指任何方法，
          过程，授权密钥，或者安装所需的其他信息
          并执行一个覆盖程序的修改版本中从用户产品
          其对应源码的修改版本。该信息必须
          足以确保修改后的对象的持续运作
          代码在任何情况下，阻止或干扰，纯粹是因为
          修改已取得</ P>
        <p>如果您在传达本条所指的对象代码的工作，或有或
          专门为一个用户产品的使用，和输送发生如
          事务的一部分，其中藏和使用权
          用户产品被转移到接受者中永久或为一个
          固定期限（无论该事务是如何表征），则
          根据本条传达相应的来源必须附有
          通过安装信息。但这一要求并不适用
          如果您或任何第三方保留安装的能力
          修正对象代码在用户产品上（例如，工作有
          被安装在ROM中）。</ P>
        <P>要求提供安装信息不包括
          要求继续提供支持服务，担保或升级
          对于已被修改或安装由收件人一个工作，或为
          在用户产品中，它已被修改或安装。访问
          网络可能会被拒绝，当修改本身
          网络的运行产生不利影响或违反了规则和
          协议在网络上通信。</ P>
        <P>对应源代码和提供的安装信息，
          符合本部分必须是一个格式是公开
          记录（以及向公众提供在一个实施
          源代码形式），并且必须要求任何密码或者密钥
          拆包，阅读或复制。</ P>
        <H4> <a id="section7"> </A> 7。附加条款。</ H4>
        <P>＆ldquo;其他权限＆rdquo;的是术语补充这一条款
          许可证由它的一个或多个条件作出例外。
          这是适用于整个程序的其他权限应
          被视为好像它们是包含在此许可证的范围内
          他们是根据适用的法律无效。如果其他权限
          仅适用于计划的一部分，也可以单独使用该部分
          根据这些权限，但整个程序仍然受到制约
          本授权不考虑额外的权限。</ P>
        <p>当你传达一个覆盖工作副本，你可以在你的选择
          删除该副本，或任何部分的任何其他权限
          它。 （附加许可可能要求自己
          除去在某些情况下，当你修改的工作。）您可以将
          物质上的其他权限，由您添加到带盖的工作，
          您拥有或可以给予相应的版权许可。</ P>
        <P>尽管有任何其他规定许可的，为你的材料
          添加到覆盖工作，你可能（如果授权的版权持有者
          该材料）的条款补充本授权的条款：</ P>
        <ul>
          <LI>一）拒绝担保责任或以不同的责任限制
            条款第15及本许可证的16;或</ li>
          <li>在指定的合理法律通告b）规定的保存或
            在材料或在适当的法律笔者归属
            含有它的作品展示的通告;或</ li>
          <LI> c）该材料的来源禁止失实陈述，或
            要求此类材料的修改版本被标记在
            合理的方式从原来的版本不同;或</ li>
          <LI> D）限制使用的许可或名称的宣传目的
            该材料的作者;或</ li>
          <LI> E）下降到授予使用一些根据商标法的权利
            商号，商标或服务商标;或</ li>
          <LI> f）规定的许可是和作者的赔偿
            材料由任何人谁输送物料（或修改版本
            它）有责任给收件人合同假设，
            这些合同的假设直接征收任何责任
            这些许可和作者。</ li>
        </ ul>
        <P>所有其他非许可的附加条款都被认为和ldquo;进一步
          限制＆rdquo;的第10条如果程序为您所指
          收到，或任何部分，包含了一个通知，指出它是
          本许可证连同一个术语，是进一步治理
          限制，可以删除这个词。如果一个授权文件包含
          进一步的限制，但允许在此再次授权或发布
          许可，您可以添加到受条款约束有盖的做工用料
          该许可文件，前提是进一步限制并
          无法生存这样的再次授权或发布。</ P>
        <p>如果您符合本部分中添加条款，有盖的工作，你
          必须放置在相关的源文件，的声明
          附加条款适用于那些文件或通知，指明
          在哪里可以找到适用的条款。</ P>
        <P>附加条款，许可或不许可的，可以在规定的
          单独书面许可的形式，或者说为例外;
          上述规定适用于任何一种方式。</ P>
        <H4> <a id="section8"> </a> 8。终止。</ H4>
        <p>您可能不会传播或修改覆盖除明确
          根据本许可规定。任何试图以其他方式传播或
          修改是无效的，而且将自动终止您的权利
          本许可（包括根据第三授予的任何专利许可
          第第11节）。</ P>
        <P>然而，如果你停止一切违反本许可证的，那么你的
          从一个特定的版权持有人许可被恢复（一）
          暂时，除非和直到版权所有者明确和
          最后终止您的许可，和（b）永久，如果版权
          持有人未能通过某种合理的方式通知违反了你
          之前停止后60天。</ P>
        <P>此外，从某个特定版权所有者的许可是
          恢复永久如果版权持有人通知的你
          违反某种合理的方式，这是你第一次有
          从接到违反本许可证（任何工作）的通知
          版权持有人，而你治愈后侵犯前30天
          你接到通知的。</ P>
        <P>根据本条终止了您的权利不会终止
          双方的下谁收到副本或权利从你的许可证
          本许可证。如果您的权利已经被终止，而不是永久
          恢复，你没有资格接受新的许可证相同
          根据第10条的材料。</ P>
        <H4> <a id="section9"> </a> 9。验收不要求具有复制。</ H4>
        <p>您不接受本许可证，以便接收或要求
          运行程序的副本。一个覆盖工作的辅助传播
          仅作为使用对等传输的结果发生
          收到一份同样不需要验收。然而，
          没有什么比这个许可等授权您传播或
          修改任何覆盖工作。这些行动侵犯版权，如果你做
          不接受许可证。因此，通过修改或传播一个
          覆盖工作，表明您接受这一许可证这么做。</ P>
        <H4> <a id="section10"> </a> 10。自动许可下游收件人。</ H4>
        <P>每次自动传达一个覆盖工作，接收者
          从原来的授权接收许可证，运行，修改和
          传播的工作，受本许可。你不负责
          强求第三方履行许可证条款的义务。</ P>
        <p>这是＆ldquo;实体交易＆rdquo;的在事务传输的控制
          组织，或一个几乎所有资产，或者一个细分
          组织，或者合并组织。如果一个传播覆盖
          从实体事务工作的结果，每一方到
          谁收到作品的复制品也受到任何的交易
          许可工作的党\的前身兴趣或有可能
          根据前一段给，加上占有的权利
          相应的工作资料来源兴趣的前身，如果
          前作有它还是可以得到它与合理的努力。</ P>
        <p>您可能没有对这项工作的任何进一步的限制
          授予或根据本许可证肯定的权利。例如，你可能
          不征收牌照费，使用费，或其他费用的行使
          根据本许可授予的权利，而你不可以发起诉讼
          （包括诉讼交叉申索或反申索）指控
          任何专利索赔是由制造，使用，销售，许诺侵害
          销售，进口或者在程序或任何部分。</ P>
        <H4> <a id="section11"> </a> 11。专利。</ H4>
        <P> A＆ldquo;＆贡献者rdquo;的是著作权人谁下此授权使用
          许可程序或该程序是基于工作。该
          做工这样的程序被贡献者\'S＆ldquo;贡献者版本＆rdquo;的。</ P>
        <p>一个贡献者\'S＆ldquo;重要的专利权利要求和rdquo;的都是专利权利要求
          拥有或控制的贡献者，无论已经获得或
          此后获得的，那些可能受到某种方式侵犯的专利权许可
          制造，使用，销售其贡献者版本，这个许可证，
          但不包括将仅侵害作为权利要求书
          后果的贡献者版本进一步的修改。为
          本定义，＆ldquo的;控制＆rdquo;的包括授予权
          专利转让许可证的方式与要求相一致
          本许可证。</ P>
        <p>每个贡献者授予您一个非排他性的，全球性的，免版税
          投稿\的必要专利的权利要求根据专利许可，
          制造，使用，销售，许诺销售，进口以及运行，修改和
          传播其贡献者版本的内容。</ P>
        <p>在以下三个自然段中，＆ldquo;专利许可＆rdquo;的任何明示
          协议或承诺，但是计价的，不执行专利
          （如明确许可执业专利或约定不
          控告专利侵权）。到＆ldquo;授予＆rdquo;的这样的专利许可给
          一方是指做出这样的协议或承诺，不强制
          对专利的一方。</ P>
        <p>如果您发布覆盖工作，明知依靠专利许可，
          与工作的对应的源代码不能用于人
          复制，免费的，根据本许可证的条款，通过
          公开的网络服务器或其他易于接触的，
          那么你必须（1）使对应的源代码是如此
          可用，或（2）安排剥夺的利益的自己
          对于这个特殊的工作，或（3）安排，其方式专利许可
          本许可证的要求相一致，延长专利
          许可证下游的接收者。 ＆ldquo;明知依托＆rdquo;的意味着你拥有
          实际的知识，但对于专利许可，您输送
          工作覆盖一个国家，或收件人\'s使用覆盖工作
          在一个国家，会侵犯在一个或多个专利标识
          国家，你有理由相信它们是有效的。</ P>
        <p>如果依照或与单个事务连接或
          安排，你传达，或采购的，输送传播
          覆盖工作，并授予专利许可给一些当事人
          接到覆盖工作，允许他们使用，传播，修改
          或发布该覆盖的特定副本，那么专利授权
          您授予自动扩展到覆盖的所有收件人
          基于它的工作原理和工作。</ P>
        <p>一个专利许可证及ldquo;＆歧视rdquo;的如果它不包含内
          其覆盖的范围内，禁止运动，或者是
          空调上的非运动之一是权利或更多的
          根据本许可明确授予。你可能不会发布覆盖
          如果你是一个党的工作的安排与第三方也就是
          在分发软件的业务，在您付款
          根据你的输送的活性的程度的第三方
          的工作，并在其下第三方补助金，以任何的
          双方谁也收到你的工作覆盖，歧视性
          与覆盖工作拷贝连接专利授权（一）
          由你转达（或复印件从这些副本制作），或（b）主要
          并与特定的产品或编辑该连接
          包含覆盖工作，除非你进入的安排，
          或者专利许可授予之前，2007年3月28日。</ P>
        <p>在本许可证的任何规定不得解释为排除或限制
          任何默示许可或其他抗辩侵权的可能
          根据适用的专利法，否则将提供给您。</ P>
        <H4> <a id="section12"> </a> 12。他人\'自由没有投降。</ H4>
        <p>如果条件是由法院命令，协议强加给你（是否
          其他）与本许可证的条件，他们不
          从这个许可证的条款为你开脱。如果你不能传达
          覆盖工作，以满足这下你的同时义务
          执照和其他相关义务，那么作为一个结果，你可以
          没有传达它在所有。例如，如果您同意该条款，你有义务
          以收取版税的进一步输送从那些你传达人
          程序，你可以同时满足这些条件，这是唯一的方法
          许可证是从输送计划完全避免。</ P>
        <H4> <a id="section13"> </a> 13。使用与GNU Affero GPL授权。</ H4>
        <P>尽管有任何其他规定许可的，你有
          许可链接或任何相结合的工作覆盖与许可工作
          根据GNU Affero GPL授权的版本3成一个单一的
          合并工作，并传达的演绎作品。这一术语
          许可证将继续适用于它是覆盖工作的一部分，
          但是GNU Affero GPL授权的特殊要求，
          部13，通过网络有关的相互作用将适用于
          结合这样。</ P>
        <H4> <a id="section14"> </a> 14。本授权的修订版。</ H4>
        <P>自由软件基金会有时候可能会发布修改和/或新版本
          GNU通用公共许可证不时。此类新版本
          在精神上将近似于目前的版本，但在细节可能会有所不同，以
          解决新的问题或疑虑。</ P>
        <p>每个版本都有不同的版本号。如果
          方案规定，在GNU通用的某个版本编号
          公共许可＆ldquo;或更新版本及rdquo;的适用于它，你有
          下面是编号的条款和条件的任何选项
          版本由自由软件发布的更新版本或
          基金会。如果程序不指定的版本号
          GNU通用公共许可证，您可以选择以往发布的任何版本
          由自由软件基金会。</ P>
        <p>如果程序指定一个代理可以决定未来
          GNU通用公共许可证的版本都可以使用，该代理\的
          接受任何版本的公开声明永久授权您
          选择该版本的程序。</ P>
        <P>后来授权版本可能会赋予您额外或不同
          权限。然而，没有额外的义务强加于任何
          作者或版权所有者自己选择的结果，遵循
          更高版本。</ P>
        <H4> <a id="section15"> </a> 15。保证免责条款。</ H4>
        <P>没有担保在方案，允许的范围内
          适用的法律。除非另有书面说明，版权所有
          者和/或其他提供程序和ldquo; AS IS＆rdquo;的不附有
          任何形式的明示或暗示，包括，但不限于，
          适销性和适用于特定的默示保证
          用途。全部的风险，如程序的质量和性能
          由您承担。如果程序出现缺陷，你承担的费用
          所有必要的服务，维修或更正。</ P>
        <H4> <a id="section16"> </a> 16。责任限制。</ H4>
        <p>在任何情况下，除非适用法律要求或同意以书面形式
          ，任何版权所有者，或其它任何一方修改和/或传达
          AS允许上面的程序，BE不对您的损失，包括任何
          一般的，特殊的，偶然的或间接的损害产生于
          使用或无法使用本程序（包括但不限于损失
          数据或执行不精确，或持续的损失，您或第三人
          当事人或程序的操作失败与其他任何程序），
          即使版权所有者和其他人已被告知的可能性
          此类损失。</ P>
        <H4> <a id="section17"> </a> 17。第15及16的解释。</ H4>
        <p>如果保修和赔偿责任限制的规定免责声明
          根据自己的条件上面不能给予当地的法律效果，
          复审法庭应适用的法律中最接近
          所有民事责任绝对豁免与连接
          程序，除非负债的担保或假设，伴随着
          该计划以换取一定的费用副本。</ P>
        <P>最后的条款和条件的</ P>
        <H3> <a name="howto"> </a>如何将这些条款用到你的新程序</ H3>
        <p>如果你开发了新程序，而且你希望它是最大的
          可以使用向公众开放，以实现这一目标的最好办法是让
          免费的软件，大家可以重新分配，并根据这些条款发生改变。</ P>
        <p>要做到这一点，请将以下声明附加到程序。这是最安全的
          他们最有效地附加到每个源文件的开头
          说明担保责任的;每个文件应该至少有
          在＆ldquo;版权及rdquo;的行以及在什么地方能看到声明全文的说明。</ P>
        <前>＆LT;用一行程序\的名字和它做什么＆GT的简单说明。
    版权所有（C）＆LT;一年＆GT; ＆LT;作者＆GT的名字;

    这个程序是免费软件：您可以重新分配和/或修改
    它在GNU通用公共许可证的条款发表
    自由软件基金会，许可证的任何版本3，或
    （由你选择）任何更新的版本。

    这个程序是分布式的希望，这将是有益的，
    但没有任何担保;没有连暗示的保证
    适销性或特定用途的。见
    GNU通用公共许可证的更多细节。

    你应该已经收到一份GNU通用公共许可证的副本
    随着这一计划。如果没有，参见LT; HTTP：//www.gnu.org/licenses/&gt ;.
</ PRE>
        <P>同时附上如何以电子及书面信件联系信息。</ P>
        <p>如果程序进行终端交互，使其输出短路
          注意到这样的，当它开始进入交互方式：</ P>
        <前>＆lt;程序＆GT;版权所有（C）＆LT;一年＆GT; ＆LT;作者＆GT的名字;
    该方案配备绝对没有担保。有关详细信息，键入"show w \"。
    这是自由软件，欢迎你重新发布
    在一定条件下;键入"show c \"，了解详情。
</ PRE>
        <P>假设的指令"show w 和播放c "应显示适当的
          零部件通用公共许可证。当然，你的程序\'S命令
          可能是不同的;对于图形用户界面，你可以使用一个＆ldquo;约盒子rdquo;的。</ P>
        <p>您也应该取得您的雇主（如果你是程序员）或学校，
          如果有的话，签订和ldquo;版权声明＆rdquo;的该方案中，如果有必要的。
          有关这方面的详细信息，以及如何应用和遵守GNU GPL，见
          ＆LT; HTTP：//www.gnu.org/licenses/&gt ;. </ P>
        <P> GNU通用公共许可证不允许将您的程序
          并入专有程序。如果你的程序是一个子程序库，你
          可以认为更有用连接专有应用
          库。如果这是你想做的事，使用GNU宽通用
          公共许可证代替本许可证。但首先，请阅读
          ＆LT; HTTP：//www.gnu.org/philosophy/why-not-lgpl.html&gt ;. </ p>';